t21/Walnut_X/Packages/.cache/Keil.Kinetis_SDK_DFP.2.2.0.pdsc
    <condition id="Kinetis DRV_MPU">
      <description>Freescale Kinetis Driver MPU dependency</description>
      <require condition="Kinetis"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="MPU"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Clock"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Interrupt"/>
    </condition>
    <condition id="Kinetis DRV_PDB">
      <description>Freescale Kinetis Driver PDB dependency</description>
      <require condition="Kinetis"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="PDB"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Clock"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Interrupt"/>
    </condition>
    <condition id="Kinetis DRV_PIT">
      <description>Freescale Kinetis Driver PIT dependency</description>
      <require condition="Kinetis"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="PIT"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Clock"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Interrupt"/>
    </condition>
    <condition id="Kinetis DRV_PWM">
      <description>Freescale Kinetis Driver PWM dependency</description>
      <require condition="Kinetis"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="PWM"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Clock"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Interrupt"/>
      <require Cclass="Device" Cgroup="KSDK OSA"    Csub="OSA"/>
    </condition>
    <condition id="Kinetis DRV_RNGA">
      <description>Freescale Kinetis Driver RNGA dependency</description>
      <require condition="Kinetis"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="RNGA"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Clock"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Interrupt"/>
    </condition>
    <condition id="Kinetis DRV_RTC">
      <description>Freescale Kinetis Driver RTC dependency</description>
      <require condition="Kinetis"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="RTC"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Clock"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Interrupt"/>
    </condition>
    <condition id="Kinetis DRV_SAI">
      <description>Freescale Kinetis Driver SAI dependency</description>
      <require condition="Kinetis"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="SAI"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Clock"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Interrupt"/>
      <require Cclass="Device" Cgroup="KSDK OSA"    Csub="OSA"/>
      <accept  Cclass="Device" Cgroup="KSDK Driver" Csub="DMA"/>
      <accept  Cclass="Device" Cgroup="KSDK Driver" Csub="eDMA"/>
    </condition>
    <condition id="Kinetis DRV_SDHC">
      <description>Freescale Kinetis Driver SDHC dependency</description>
      <require condition="Kinetis"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="SDHC"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Clock"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Interrupt"/>
      <require Cclass="Device" Cgroup="KSDK OSA"    Csub="OSA"/>
    </condition>
    <condition id="Kinetis DRV_SPI_IRQ">
      <description>Freescale Kinetis Driver SPI IRQ dependency</description>
      <require condition="Kinetis Unknown"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="SPI"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Clock"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Interrupt"/>
      <require Cclass="Device" Cgroup="KSDK OSA"    Csub="OSA"/>
    </condition>
    <condition id="Kinetis DRV_SPI_DMA">
      <description>Freescale Kinetis Driver SPI DMA dependency</description>
      <require condition="Kinetis Unknown"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="SPI"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Clock"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Interrupt"/>
      <require Cclass="Device" Cgroup="KSDK OSA"    Csub="OSA"/>
      <require Cclass="Device" Cgroup="KSDK Driver" Csub="DMA"/>
    </condition>
    <condition id="Kinetis DRV_TPM">
      <description>Freescale Kinetis Driver TPM dependency</description>
      <require condition="Kinetis Unknown"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="TPM"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Interrupt"/>
      <require Cclass="Device" Cgroup="KSDK OSA"    Csub="OSA"/>
    </condition>
    <condition id="Kinetis DRV_TSI">
      <description>Freescale Kinetis Driver TSI dependency</description>
      <require condition="Kinetis Unknown"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="TSI"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Clock"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Interrupt"/>
      <require Cclass="Device" Cgroup="KSDK OSA"    Csub="OSA"/>
    </condition>
    <condition id="Kinetis DRV_UART_IRQ">
      <description>Freescale Kinetis Driver UART IRQ dependency</description>
      <require condition="Kinetis"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="UART"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Clock"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Interrupt"/>
      <require Cclass="Device" Cgroup="KSDK OSA"    Csub="OSA"/>
    </condition>
    <condition id="Kinetis DRV_UART_DMA">
      <description>Freescale Kinetis Driver UART DMA dependency</description>
      <require condition="Kinetis"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="UART"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Clock"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Interrupt"/>
      <require Cclass="Device" Cgroup="KSDK OSA"    Csub="OSA"/>
      <accept  Cclass="Device" Cgroup="KSDK Driver" Csub="DMA"/>
      <accept  Cclass="Device" Cgroup="KSDK Driver" Csub="eDMA"/>
    </condition>
    <condition id="Kinetis DRV_VREF">
      <description>Freescale Kinetis Driver VREF dependency</description>
      <require condition="Kinetis"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="VREF"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Clock"/>
    </condition>
    <condition id="Kinetis DRV_WDOG">
      <description>Freescale Kinetis Driver WDOG dependency</description>
      <require condition="Kinetis"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="WDOG"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="SIM"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Clock"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Interrupt"/>
    </condition>
    <condition id="Kinetis DRV_XBAR">
      <description>Freescale Kinetis Driver XBAR dependency</description>
      <require condition="Kinetis Unknown"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="XBAR"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Clock"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Interrupt"/>
    </condition>

    <condition id="Kinetis_K64F12 SYS_Clock">
      <description>Freescale Kinetis K64F12 System Clock dependency</description>
      <require condition="Kinetis"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="SIM"/>
      <require Cclass="Device" Cgroup="KSDK OSA"    Csub="OSA"/>
      <!-- K64F12 specifics -->
      <require condition="K64F12"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="MCG"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="OSC"/>
      <require Cclass="Device" Cgroup="KSDK Driver" Csub="RTC"/>
    </condition>
    <condition id="Kinetis SYS_HwTimer">
      <description>Freescale Kinetis System HW Timer dependency</description>
      <require condition="Kinetis"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Clock"/>
    </condition>
    <condition id="Kinetis SYS_HwTimer_PIT">
      <description>Freescale Kinetis System HW Timer PIT dependency</description>
      <require condition="Kinetis"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Clock"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Interrupt"/>
      <require Cclass="Device" Cgroup="KSDK OSA"    Csub="OSA"/>
      <require Cclass="Device" Cgroup="KSDK Driver" Csub="PIT"/>
    </condition>
    <condition id="Kinetis SYS_HwTimer_SysTick">
      <description>Freescale Kinetis System HW Timer SysTick dependency</description>
      <require condition="Kinetis"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Clock"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Interrupt"/>
      <require Cclass="Device" Cgroup="KSDK OSA"    Csub="OSA"/>
    </condition>
