t21/Walnut_X/Packages/.cache/Keil.Kinetis_SDK_DFP.2.2.0.pdsc
    <condition id="Kinetis SYS_Power">
      <description>Freescale Kinetis System Power dependency</description>
      <require condition="Kinetis"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="LLWU"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="PMC"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="RCM"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="SMC"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="SIM"/>
      <require Cclass="Device" Cgroup="KSDK OSA"    Csub="OSA"/>
      <require Cclass="Device" Cgroup="KSDK Driver" Csub="GPIO"/>
    </condition>

    <condition id="Kinetis OSA_BM">
      <description>Freescale Kinetis OSA Bare Metal dependency</description>
      <require condition="Kinetis"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="LPTMR"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Clock"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Interrupt"/>
    </condition>

    <condition id="Kinetis_K64F12 Utility_DebugConsole">
      <description>Freescale Kinetis K64F12 Utility Debug Console dependency</description>
      <require condition="Kinetis"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Clock"/>
      <require Cclass="Device" Cgroup="KSDK OSA"    Csub="OSA"/>
      <!-- K64F12 specifics -->
      <require condition="K64F12"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="UART"/>
    </condition>
    <condition id="Kinetis Utility_Misc">
      <description>Freescale Kinetis K64F12 Utility Misc dependency</description>
      <require condition="Kinetis"/>
      <require Cclass="Device" Cgroup="KSDK Utility" Csub="Debug Console"/>
    </condition>

    <condition id="Kinetis FRDM-K64F">
      <description>Freescale Kinetis FRDM-K64F dependency</description>
      <require condition="K64F12"/>
      <require Cclass="Device" Cgroup="KSDK HAL"     Csub="MCG"/>
      <require Cclass="Device" Cgroup="KSDK HAL"     Csub="PORT"/>
      <require Cclass="Device" Cgroup="KSDK HAL"     Csub="SIM"/>
      <require Cclass="Device" Cgroup="KSDK System"  Csub="Clock"/>
      <require Cclass="Device" Cgroup="KSDK Utility" Csub="Debug Console"/>
      <require Cclass="Device" Cgroup="KSDK Driver"  Csub="GPIO"/>
    </condition>
    <condition id="Kinetis FRDM-K64F BSP">
      <description>Freescale Kinetis FRDM-K64F BSP dependency</description>
      <require condition="K64F12"/>
      <require Cclass="Device" Cgroup="KSDK Configuration" Csub="FRDM-K64F"/>
    </condition>
    <condition id="Kinetis FRDM-K64F BSP I2C">
      <description>Freescale Kinetis FRDM-K64F BSP with CMSIS I2C Driver dependency</description>
      <require condition="K64F12"/>
      <require Cclass="Device" Cgroup="KSDK Configuration" Csub="FRDM-K64F"/>
      <require Cclass="CMSIS Driver" Cgroup="I2C"/>
    </condition>

    <condition id="Kinetis_K64F CMSIS_Driver ETH_MAC">
      <description>Freescale Kinetis K64F CMSIS ETH_MAC Driver dependency</description>
      <require condition="Kinetis_K64F"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="ENET"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="OSC"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="SIM"/>
    </condition>
    <condition id="Kinetis_K64F CMSIS_Driver I2C">
      <description>Freescale Kinetis K64F CMSIS I2C Driver dependency</description>
      <require condition="Kinetis_K64F"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="I2C"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="GPIO"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="PORT"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Clock"/>
      <require Cclass="Device" Cgroup="KSDK Driver" Csub="eDMA"/>
    </condition>
    <condition id="Kinetis_K64F CMSIS_Driver SPI">
      <description>Freescale Kinetis K64F CMSIS SPI Driver dependency</description>
      <require condition="Kinetis_K64F"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="DSPI"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="GPIO"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="PORT"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Clock"/>
    </condition>
    <condition id="Kinetis_K64F CMSIS_Driver USART">
      <description>Freescale Kinetis K64F CMSIS USART Driver dependency</description>
      <require condition="Kinetis_K64F"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="UART"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Clock"/>
      <require Cclass="Device" Cgroup="KSDK Driver" Csub="eDMA"/>
    </condition>
    <condition id="Kinetis_K64F CMSIS_Driver SAI">
      <description>Freescale Kinetis K64F CMSIS SAI Driver dependency</description>
      <require condition="Kinetis_K64F"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="SAI"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Clock"/>
      <require Cclass="Device" Cgroup="KSDK Driver" Csub="eDMA"/>
    </condition>
    <condition id="Kinetis_K64F CMSIS_Driver MCI">
      <description>Freescale Kinetis K64F CMSIS MCI Driver dependency</description>
      <require condition="Kinetis_K64F"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="GPIO"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="PORT"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="SIM"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="SDHC"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Clock"/>
    </condition>
    <condition id="Kinetis_K64F CMSIS_Driver USB">
      <description>Freescale Kinetis K64F CMSIS USB Driver dependency</description>
      <require condition="Kinetis_K64F"/>
      <require Cclass="CMSIS"  Cgroup="RTOS"/>
      <require Cclass="Device" Cgroup="KSDK Driver" Csub="GPIO"/>
    </condition>
  </conditions>

  <taxonomy>
    <description Cclass="Device" Cgroup="KSDK HAL">Kinetis SDK Hardware Abstraction Layer (HAL)</description>
    <description Cclass="Device" Cgroup="KSDK Driver">Kinetis SDK Peripheral Drivers</description>
    <description Cclass="Device" Cgroup="KSDK System">Kinetis SDK System Drivers</description>
    <description Cclass="Device" Cgroup="KSDK OSA" doc="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__os__abstraction.html">Kinetis SDK OS Abstraction Layer (OSA)</description>
    <description Cclass="Device" Cgroup="KSDK Utility">Kinetis SDK Utilities</description>
    <description Cclass="Board Support" Cgroup="Drivers">Kinetis BSP Drivers</description>
  </taxonomy>

  <apis>
    <api Cclass="Device" Cgroup="KSDK Configuration" exclusive="1">
      <description>Kinetis SDK Framework Configuration</description>
      <files>
        <file category="doc" name="doc/Getting Started with Kinetis SDK (KSDK) v.1.2.pdf"/>
      </files>
    </api>
  </apis>
  <boards>  
    <board name="FRDM-K64F" vendor="Freescale" revision="Rev. A" orderForm="http://www.freescale.com/webapp/sps/site/prod_summary.jsp?code=FRDM-K64F" salesContact="https://www.freescale.com/webapp/servicerequest.create_SR.framework">
      <mountedDevice deviceIndex="0" Dvendor="Freescale:78" Dname="MK64FN1M0VLL12"/>
      <compatibleDevice deviceIndex="0" Dvendor="Freescale:78" Dname="MK64FX512xxx12"/>
      <image small="addon_mdk\Images\FRDM-K64F_small.png" large="addon_mdk\Images\FRDM-K64F_large.png"/>
      <description>
        The FRDM-K64F is a development board for the Kinetis K24, K63 and K64 120 MHz 32-bit ARM® Cortex™-M4 MCUs.
        It features the Kinetis MK64FN1M0VMD12 low-power MCU with 1MB Flash, 256 KB SRAM, USB USB and Ethernet MAC.
      </description>
      <book category="overview"  name="http://www.freescale.com/webapp/sps/site/prod_summary.jsp?code=FRDM-K64F" title="FRDM-K64F Web Page"/>
      <book category="setup"     name="addon_mdk\Documents\FRDMK64QSG.pdf" title="Quick Start Guide"/>
      <book category="schematic" name="addon_mdk\Documents\FRDM-K64F_SCH.pdf" title="FRDM-K64F Schematics"/>
      <book category="manual"    name="addon_mdk\Documents\FRDMK64FUG.pdf" title="User Manual"/>
      <feature type="ODbg"          n="1"              name="Onboard open-standard serial and debug adaptor (OpenSDA)"/>
      <feature type="PWR"           n="5"              name="USB Powered"/>
      <feature type="MemCard"       n="1"              name="Micro SD Card holder"/>
      <feature type="USB"           n="1"              name="Micro-AB USB connector"/>
      <feature type="USB"           n="1"              name="OpenSDAv2 Micro USB connector"/>
      <feature type="ETH"           n="1"              name="10/100 Ethernet Port"/>
      <feature type="Button"        n="3"/>
      <feature type="Accelerometer" n="1"              name="Freescale FXOS8700CQ low-power, six-axis Xtrinsic sensor"/>
      <feature type="DIO"           n="8"              name="nRF24L01+ Nordic 2.4G Radio module expansion pins"/>
      <feature type="DIO"           n="4"              name="JY-MCU BT board V1.05 BT module expansion pins"/>
      <feature type="DIO"           n="33"             name="Digital IOs"/>
      <feature type="AIO"           n="9"              name="Analog IOs"/>
      <feature type="LED"           n="1"              name="RGB LED"/>
      <debugInterface adapter="JTAG/SW" connector="10 pin Cortex debug (0.05 inch connector)"/>
      <debugInterface adapter="JTAG/SW" connector="SDA 10 pin Cortex debug (0.05 inch connector)"/>
    </board>
  </boards>

  <examples>
    <!-- Freedom FRDM-K64F Development Board -->
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="addon_mdk\Boards\Freescale\FRDM-K64F\Blinky">
      <description>CMSIS-RTOS Blinky example</description>
      <board name="FRDM-K64F" vendor="Freescale"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <example name="USB Device HID" doc="Abstract.txt" folder="addon_mdk\Boards\Freescale\FRDM-K64F\Middleware\USB\Device\HID" version="1.0.0">
      <description>USB Human Interface Device providing access from PC to board LEDs and push buttons.</description>
      <board name="FRDM-K64F" vendor="Freescale"/>
      <project>
        <environment name="uv" load="HID.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="USB" Cgroup="Device" Csub="HID"/>
        <category>Middleware</category>
        <category>USB Device</category>
        <keyword>HID</keyword>
      </attributes>
    </example>

    <example name="USB Device Mass Storage" doc="Abstract.txt" folder="addon_mdk\Boards\Freescale\FRDM-K64F\Middleware\USB\Device\MassStorage" version="1.0.0">
      <description>USB Mass Storage Device using SD/MMC Memory Card or RAM as storage media</description>
      <board name="FRDM-K64F" vendor="Freescale"/>
      <project>
        <environment name="uv" load="MassStorage.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="USB" Cgroup="Device" Csub="MSC"/>
        <category>Middleware</category>
        <category>USB Device</category>
        <keyword>Memory Disk</keyword>
      </attributes>
    </example>

    <example name="USB Host Mass Storage" doc="Abstract.txt" folder="addon_mdk\Boards\Freescale\FRDM-K64F\Middleware\USB\Host\MassStorage" version="1.0.0">
      <description>USB Host file manipulation example: create, read, copy, delete files from USB Mass Storage Device and format storage device</description>
      <board name="FRDM-K64F" vendor="Freescale"/>
      <project>
        <environment name="uv" load="MassStorage.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="USB" Cgroup="Host" Csub="MSC"/>
        <category>Middleware</category>
        <category>USB Host</category>
        <keyword>Memory Disk</keyword>
      </attributes>
    </example>

    <example name="USB Host Keyboard" doc="Abstract.txt" folder="addon_mdk\Boards\Freescale\FRDM-K64F\Middleware\USB\Host\Keyboard" version="1.0.0">
      <description>Measure example using USB HID Keyboard as input device</description>
      <board name="FRDM-K64F" vendor="Freescale"/>
      <project>
        <environment name="uv" load="Keyboard.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="USB" Cgroup="Host" Csub="HID"/>
        <category>Middleware</category>
        <category>USB Host</category>
        <keyword>Keyboard</keyword>
      </attributes>
    </example>

    <example name="File System Demo" doc="Abstract.txt" folder="addon_mdk\Boards\Freescale\FRDM-K64F\Middleware\FileSystem\File_Demo" version="1.0.0">
      <description>File manipulation example: create, read, copy, delete files on any enabled drive (SD/MMC Card, NOR/NAND Flash, RAM) and format each drive</description>
      <board name="FRDM-K64F" vendor="Freescale"/>
      <project>
        <environment name="uv" load="File_Demo.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="File System" Cgroup="Drive"/>
        <category>Middleware</category>
        <category>File System</category>
        <keyword>SD/MMC Card</keyword>
      </attributes>
    </example>

