t21/Walnut_X/Packages/.cache/Keil.Kinetis_SDK_DFP.2.2.0.pdsc
    <example name="BSD Client" doc="Abstract.txt" folder="addon_mdk\Boards\Freescale\FRDM-K64F\Middleware\Network\BSD_Client" version="1.0.0">
      <description>Example using BSD sockets to send commands to remote server</description>
      <board name="FRDM-K64F" vendor="Freescale"/>
      <project>
        <environment name="uv" load="BSD_Client.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Network" Cgroup="Socket" Csub="BSD"/>
        <category>Middleware</category>
        <category>Network</category>
        <keyword>BSD</keyword>
      </attributes>
    </example>

    <example name="BSD Server" doc="Abstract.txt" folder="addon_mdk\Boards\Freescale\FRDM-K64F\Middleware\Network\BSD_Server" version="1.0.0">
      <description>Example using BSD sockets to accept commands from remote clients</description>
      <board name="FRDM-K64F" vendor="Freescale"/>
      <project>
        <environment name="uv" load="BSD_Server.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Network" Cgroup="Socket" Csub="BSD"/>
        <category>Middleware</category>
        <category>Network</category>
        <keyword>BSD</keyword>
      </attributes>
    </example>

    <example name="FTP Server" doc="Abstract.txt" folder="addon_mdk\Boards\Freescale\FRDM-K64F\Middleware\Network\FTP_Server" version="1.0.0">
      <description>File Server using FTP protocol with SD/MMC Memory Card as storage media</description>
      <board name="FRDM-K64F" vendor="Freescale"/>
      <project>
        <environment name="uv" load="FTP_Server.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Network" Cgroup="Service" Csub="FTP Server"/>
        <category>Middleware</category>
        <category>Network</category>
        <keyword>FTP</keyword>
      </attributes>
    </example>

    <example name="HTTP Server" doc="Abstract.txt" folder="addon_mdk\Boards\Freescale\FRDM-K64F\Middleware\Network\HTTP_Server" version="1.0.0">
      <description>Compact Web Server with CGI interface</description>
      <board name="FRDM-K64F" vendor="Freescale"/>
      <project>
        <environment name="uv" load="HTTP_Server.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Network" Cgroup="Service" Csub="Web Server Compact"/>
        <category>Middleware</category>
        <category>Network</category>
        <keyword>Web Server</keyword>
        <keyword>HTTP</keyword>
      </attributes>
    </example>

    <example name="SNMP Agent" doc="Abstract.txt" folder="addon_mdk\Boards\Freescale\FRDM-K64F\Middleware\Network\SNMP_Agent" version="1.0.0">
      <description>Example showing how to use a Simple Network Management Protocol (SNMP)</description>
      <board name="FRDM-K64F" vendor="Freescale"/>
      <project>
        <environment name="uv" load="SNMP_Agent.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Network" Cgroup="Service" Csub="SNMP Agent"/>
        <category>Middleware</category>
        <category>Network</category>
        <keyword>SNMP</keyword>
      </attributes>
    </example>

    <example name="Telnet Server" doc="Abstract.txt" folder="addon_mdk\Boards\Freescale\FRDM-K64F\Middleware\Network\Telnet_Server" version="1.0.0">
      <description>Command-line Host service example using Telnet protocol</description>
      <board name="FRDM-K64F" vendor="Freescale"/>
      <project>
        <environment name="uv" load="Telnet_Server.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Network" Cgroup="Service" Csub="Telnet Server"/>
        <category>Middleware</category>
        <category>Network</category>
        <keyword>Telnet</keyword>
      </attributes>
    </example>
  </examples>

  <components>
    <component Cclass="Device" Cgroup="Startup" Cversion="2.8" condition="Kinetis_ARMCC">
      <description>System Startup for Freescale Kinetis Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_DEVICE_STARTUP_KINETIS      /* Device Startup for Kinetis Series */
      </RTE_Components_h>
      <files>
        <!-- include folders -->
        <file category="include" name="platform/devices/"/>

        <!-- startup files -->
        <file category="source" name="platform/devices/startup.c"/>
        <file category="source" name="platform/devices/MK64F12/startup/arm/startup_MK64F12.s" attr="config" version="2.8" condition="K64F12"/>

        <!-- system files -->
        <file category="header" name="platform/devices/MK64F12/startup/system_MK64F12.h" attr="config" version="2.8" condition="K64F12"/>
        <file category="source" name="platform/devices/MK64F12/startup/system_MK64F12.c" attr="config" version="2.8" condition="K64F12"/>

        <!-- linker scripts -->
    <!--<file category="linkerScript" name="platform/devices/MK64F12/linker/arm/MK64FX512xxx12_flash.scf" attr="config" version="2.8" condition="K64FX512"/>-->
    <!--<file category="linkerScript" name="platform/devices/MK64F12/linker/arm/MK64FX512xxx12_ram.scf"   attr="config" version="2.8" condition="K64FX512"/>-->
        <file category="linkerScript" name="platform/devices/MK64F12/linker/arm/MK64FN1M0xxx12_flash.scf" attr="config" version="2.8" condition="K64FN1M0"/>
        <file category="linkerScript" name="platform/devices/MK64F12/linker/arm/MK64FN1M0xxx12_ram.scf"   attr="config" version="2.8" condition="K64FN1M0"/>

        <!-- device configurations required by drivers at the moment -->
        <file category="header" name="addon_cmsis/Driver/MK64F/Config/RTE_Device.h" attr="config" version="1.1.0" condition="K64F12"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Cversion="2.8" condition="Kinetis_GCC">
      <description>System Startup for Freescale Kinetis Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_DEVICE_STARTUP_KINETIS      /* Device Startup for Kinetis Series */
      </RTE_Components_h>
      <files>
        <!-- include folders -->
        <file category="include" name="platform/devices/"/>

        <!-- startup files -->
        <file category="source" name="platform/devices/startup.c"/>
        <file category="source" name="platform/devices/MK64F12/startup/gcc/startup_MK64F12.S" attr="config" version="2.8" condition="K64F12"/>

        <!-- system files -->
        <file category="header" name="platform/devices/MK64F12/startup/system_MK64F12.h" attr="config" version="2.8" condition="K64F12"/>
        <file category="source" name="platform/devices/MK64F12/startup/system_MK64F12.c" attr="config" version="2.8" condition="K64F12"/>

