t21/Walnut_X/Packages/.cache/Keil.Kinetis_SDK_DFP.2.2.0.pdsc
    <component Cclass="Device" Cgroup="KSDK HAL" Csub="FLEXIO_I2C" Cversion="1.2.0" condition="Kinetis Unknown">
      <description>FlexIO I2C (FLEXIO_I2C)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_FLEXIO_I2C
      </RTE_Components_h>
      <files>
    <!--<file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__flexio__i2c__hal.html"/>-->
        <file category="header" name="platform/hal/inc/fsl_flexio_i2c_hal.h"/>
        <file category="source" name="platform/hal/src/flexio/fsl_flexio_i2c_hal.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK HAL" Csub="FLEXIO_I2S" Cversion="1.2.0" condition="Kinetis Unknown">
      <description>FlexIO I2S (FLEXIO_I2S)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_FLEXIO_I2S
      </RTE_Components_h>
      <files>
    <!--<file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__flexio__i2s__hal.html"/>-->
        <file category="header" name="platform/hal/inc/fsl_flexio_i2s_hal.h"/>
        <file category="source" name="platform/hal/src/flexio/fsl_flexio_i2s_hal.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK HAL" Csub="FLEXIO_SPI" Cversion="1.2.0" condition="Kinetis Unknown">
      <description>FlexIO SPI (FLEXIO_SPI)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_FLEXIO_SPI
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__flexio__spi__hal.html"/>
        <file category="header" name="platform/hal/inc/fsl_flexio_spi_hal.h"/>
        <file category="source" name="platform/hal/src/flexio/fsl_flexio_spi_hal.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK HAL" Csub="FLEXIO_UART" Cversion="1.2.0" condition="Kinetis Unknown">
      <description>FlexIO UART (FLEXIO_UART)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_FLEXIO_UART
      </RTE_Components_h>
      <files>
    <!--<file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__flexio__uart__hal.html"/>-->
        <file category="header" name="platform/hal/inc/fsl_flexio_uart_hal.h"/>
        <file category="source" name="platform/hal/src/flexio/fsl_flexio_uart_hal.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK HAL" Csub="FTM" Cversion="1.2.0" condition="Kinetis">
      <description>FlexTimer (FTM)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_FTM
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__ftm__hal.html"/>
        <file category="header" name="platform/hal/inc/fsl_ftm_hal.h"/>
        <file category="source" name="platform/hal/src/ftm/fsl_ftm_hal.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK HAL" Csub="GPIO" Cversion="1.2.0" condition="Kinetis">
      <description>General Purpose Input/Output (GPIO)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_GPIO
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__gpio__hal.html"/>
        <file category="header" name="platform/hal/inc/fsl_gpio_hal.h"/>
        <file category="source" name="platform/hal/src/gpio/fsl_gpio_hal.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK HAL" Csub="I2C" Cversion="1.2.0" condition="Kinetis">
      <description>Inter-Integrated Circuit (I2C)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_I2C
      </RTE_Components_h>
      <files>
        <file category="include" name="platform/utilities/inc/"/>
        <file category="doc"     name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__i2c__hal.html"/>
        <file category="header"  name="platform/hal/inc/fsl_i2c_hal.h"/>
        <file category="source"  name="platform/hal/src/i2c/fsl_i2c_hal.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK HAL" Csub="LLWU" Cversion="1.2.0" condition="Kinetis">
      <description>Low-Leakage Wakeup Unit (LLWU)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_LLWU
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__llwu__hal.html"/>
        <file category="header" name="platform/hal/inc/fsl_llwu_hal.h"/>
        <file category="source" name="platform/hal/src/llwu/fsl_llwu_hal.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK HAL" Csub="LMEM" Cversion="1.2.0" condition="Kinetis Unknown">
      <description>Local Memory Controller (LMEM) Cache</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_LMEM
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__local__memory__controller__cache__hal.html"/>
        <file category="header" name="platform/hal/inc/fsl_lmem_cache_hal.h"/>
        <file category="source" name="platform/hal/src/lmem/fsl_lmem_cache_hal.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK HAL" Csub="LPSCI" Cversion="1.2.0" condition="Kinetis Unknown">
      <description>Low Power Serial Communication Interface (LPSCI)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_LPSCI
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__lpsci__hal.html"/>
        <file category="header" name="platform/hal/inc/fsl_lpsci_hal.h"/>
        <file category="source" name="platform/hal/src/lpsci/fsl_lpsci_hal.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK HAL" Csub="LPTMR" Cversion="1.2.0" condition="Kinetis">
      <description>Low Power Timer (LPTMR)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_LPTMR
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__lptmr__hal.html"/>
        <file category="header" name="platform/hal/inc/fsl_lptmr_hal.h"/>
        <file category="source" name="platform/hal/src/lptmr/fsl_lptmr_hal.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK HAL" Csub="LPUART" Cversion="1.2.0" condition="Kinetis Unknown">
      <description>Low Power Universal Asynchronous Receiver/Transmitter (LPUART)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_LPUART
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__lpuart__hal.html"/>
        <file category="header" name="platform/hal/inc/fsl_lpuart_hal.h"/>
        <file category="source" name="platform/hal/src/lpuart/fsl_lpuart_hal.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK HAL" Csub="MCG" Cversion="1.2.0" condition="Kinetis">
      <description>Multipurpose Clock Generator (MCG)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_MCG
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__mcg__hal.html"/>
        <file category="header" name="platform/hal/inc/fsl_mcg_hal.h"/>
        <file category="header" name="platform/hal/inc/fsl_mcg_hal_modes.h"/>
        <file category="source" name="platform/hal/src/mcg/fsl_mcg_hal.c"/>
        <file category="source" name="platform/hal/src/mcg/fsl_mcg_hal_modes.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK HAL" Csub="MCG_Lite" Cversion="1.2.0" condition="Kinetis Unknown">
      <description>Multipurpose Clock Generator Lite (MCG_Lite)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_MCG_LITE
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__mcglite__hal.html"/>
        <file category="header" name="platform/hal/inc/fsl_mcglite_hal.h"/>
        <file category="header" name="platform/hal/inc/fsl_mcglite_hal_modes.h"/>
        <file category="source" name="platform/hal/src/mcglite/fsl_mcglite_hal.c"/>
        <file category="source" name="platform/hal/src/mcglite/fsl_mcglite_hal_modes.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK HAL" Csub="MMDVSQ" Cversion="1.2.0" condition="Kinetis Unknown">
      <description>Memory-Mapped Divide and Square Root(MMDVSQ)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_MMDVSQ
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__mmdvsq__hal.html"/>
        <file category="header" name="platform/hal/inc/fsl_mmdvsq_hal.h"/>
        <file category="source" name="platform/hal/src/mmdvsq/fsl_mmdvsq_hal.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK HAL" Csub="MPU" Cversion="1.2.0" condition="Kinetis">
      <description>Memory Protection Unit (MPU)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_MPU
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__mpu__hal.html"/>
        <file category="header" name="platform/hal/inc/fsl_mpu_hal.h"/>
        <file category="source" name="platform/hal/src/mpu/fsl_mpu_hal.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK HAL" Csub="OSC" Cversion="1.2.0" condition="Kinetis">
      <description>Oscillator (OSC)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_OSC
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__osc__hal.html"/>
        <file category="header" name="platform/hal/inc/fsl_osc_hal.h"/>
        <file category="source" name="platform/hal/src/osc/fsl_osc_hal.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK HAL" Csub="PDB" Cversion="1.2.0" condition="Kinetis">
      <description>Programmable Delay Block (PDB)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_PDB
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__pdb__hal.html"/>
        <file category="header" name="platform/hal/inc/fsl_pdb_hal.h"/>
        <file category="source" name="platform/hal/src/pdb/fsl_pdb_hal.c"/>
      </files>
    </component>
