t21/Walnut_X/Packages/.cache/Keil.Kinetis_SDK_DFP.2.2.0.pdsc
    <component Cclass="Device" Cgroup="KSDK HAL" Csub="PIT" Cversion="1.2.0" condition="Kinetis">
      <description>Periodic Interrupt Timer (PIT)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_PIT
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__pit__hal.html"/>
        <file category="header" name="platform/hal/inc/fsl_pit_hal.h"/>
        <file category="source" name="platform/hal/src/pit/fsl_pit_hal.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK HAL" Csub="PMC" Cversion="1.2.0" condition="Kinetis">
      <description>Power Management Controller (PMC)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_PMC
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__pmc__hal.html"/>
        <file category="header" name="platform/hal/inc/fsl_pmc_hal.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK HAL" Csub="PORT" Cversion="1.2.0" condition="Kinetis">
      <description>Port Control and Interrupts (PORT)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_PORT
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__port__hal.html"/>
        <file category="header" name="platform/hal/inc/fsl_port_hal.h"/>
        <file category="source" name="platform/hal/src/port/fsl_port_hal.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK HAL" Csub="PWM" Cversion="1.2.0" condition="Kinetis">
      <description>Pulse Width Modulator (PWM)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_PWM
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__pwm__hal.html"/>
        <file category="header" name="platform/hal/inc/fsl_pwm_hal.h"/>
        <file category="source" name="platform/hal/src/pwm/fsl_pwm_hal.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK HAL" Csub="RCM" Cversion="1.2.0" condition="Kinetis">
      <description>Reset Control Module (RCM)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_RCM
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__rcm__hal.html"/>
        <file category="header" name="platform/hal/inc/fsl_rcm_hal.h"/>
        <file category="source" name="platform/hal/src/rcm/fsl_rcm_hal.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK HAL" Csub="RNGA" Cversion="1.2.0" condition="Kinetis">
      <description>Random Number Generator Accelerator (RNGA)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_RNGA
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__rnga__hal.html"/>
        <file category="header" name="platform/hal/inc/fsl_rnga_hal.h"/>
        <file category="source" name="platform/hal/src/rnga/fsl_rnga_hal.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK HAL" Csub="RTC" Cversion="1.2.0" condition="Kinetis HAL_RTC">
      <description>Real Time Clock (RTC)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_RTC
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__rtc__hal.html"/>
        <file category="header" name="platform/hal/inc/fsl_rtc_hal.h"/>
        <file category="source" name="platform/hal/src/rtc/fsl_rtc_hal.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK HAL" Csub="SAI" Cversion="1.2.0" condition="Kinetis">
      <description>Synchronous Audio Interface (SAI)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_SAI
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__sai__hal.html"/>
        <file category="header" name="platform/hal/inc/fsl_sai_hal.h"/>
        <file category="source" name="platform/hal/src/sai/fsl_sai_hal.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK HAL" Csub="SDHC" Cversion="1.2.0" condition="Kinetis">
      <description>Secured Digital Host Controller (SDHC)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_SDHC
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__sdhc__hal.html"/>
        <file category="header" name="platform/hal/inc/fsl_sdhc_hal.h"/>
        <file category="source" name="platform/hal/src/sdhc/fsl_sdhc_hal.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK HAL" Csub="SIM" Cversion="1.2.0" condition="Kinetis">
      <description>System Integration Module (SIM)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_SIM
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__sim__hal.html"/>
        <file category="header" name="platform/hal/inc/fsl_sim_hal.h"/>
        <file category="source" name="platform/hal/src/sim/MK64F12/fsl_sim_hal_MK64F12.c" condition="K64F12"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK HAL" Csub="SMC" Cversion="1.2.0" condition="Kinetis">
      <description>System Mode Controller (SMC)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_SMC
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__smc__hal.html"/>
        <file category="header" name="platform/hal/inc/fsl_smc_hal.h"/>
        <file category="source" name="platform/hal/src/smc/fsl_smc_hal.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK HAL" Csub="SPI" Cversion="1.2.0" condition="Kinetis Unknown">
      <description>Serial Peripheral Interface (SPI)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_SPI
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__spi__hal.html"/>
        <file category="header" name="platform/hal/inc/fsl_spi_hal.h"/>
        <file category="source" name="platform/hal/src/spi/fsl_spi_hal.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK HAL" Csub="TPM" Cversion="1.2.0" condition="Kinetis Unknown">
      <description>Timer/PWM Module (TPM)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_TPM
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__tpm__hal.html"/>
        <file category="header" name="platform/hal/inc/fsl_tpm_hal.h"/>
        <file category="source" name="platform/hal/src/tpm/fsl_tpm_hal.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK HAL" Csub="TSI" Cversion="1.2.0" condition="Kinetis Unknown">
      <description>Touch Sense Input (TSI)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_TSI
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__tsi__hal.html"/>
        <file category="header" name="platform/hal/inc/fsl_tsi_hal.h"/>
        <file category="source" name="platform/hal/src/tsi/fsl_tsi_hal.c"/>
        <file category="source" name="platform/hal/src/tsi/fsl_tsi_v2_hal_specific.c"/>
        <file category="source" name="platform/hal/src/tsi/fsl_tsi_v4_hal_specific.c"/>
      </files>
    </component>
