t21/Walnut_X/Packages/.cache/Keil.Kinetis_SDK_DFP.2.2.0.pdsc
    <component Cclass="Device" Cgroup="KSDK HAL" Csub="UART" Cversion="1.2.0" condition="Kinetis">
      <description>Universal Asynchronous Receiver/Transmitter (UART)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_UART
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__uart__hal.html"/>
        <file category="header" name="platform/hal/inc/fsl_uart_hal.h"/>
        <file category="source" name="platform/hal/src/uart/fsl_uart_hal.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK HAL" Csub="VREF" Cversion="1.2.0" condition="Kinetis">
      <description>Reference (VREF)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_VREF
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__vref__hal.html"/>
        <file category="header" name="platform/hal/inc/fsl_vref_hal.h"/>
        <file category="source" name="platform/hal/src/vref/fsl_vref_hal.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK HAL" Csub="WDOG" Cversion="1.2.0" condition="Kinetis">
      <description>Watchdog Timer (WDOG)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_WDOG
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__wdog__hal.html"/>
        <file category="header" name="platform/hal/inc/fsl_wdog_hal.h"/>
        <file category="source" name="platform/hal/src/wdog/fsl_wdog_hal.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK HAL" Csub="XBAR" Cversion="1.2.0" condition="Kinetis Unknown">
      <description>Inter-Peripheral Crossbar Switch (XBAR)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_XBAR
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__xbar__hal.html"/>
        <file category="header" name="platform/hal/inc/fsl_xbar_hal.h"/>
        <file category="source" name="platform/hal/src/xbar/fsl_xbar_hal.c"/>
      </files>
    </component>

    <!-- KSDK Driver -->
    <component Cclass="Device" Cgroup="KSDK Driver" Csub="ADC16" Cversion="1.2.0" condition="Kinetis DRV_ADC16">
      <description>16-bit SAR Analog-to-digital converter (ADC16)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_ADC16
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__adc16__driver.html"/>
        <file category="header" name="platform/drivers/inc/fsl_adc16_driver.h"/>
        <file category="source" name="platform/drivers/src/adc16/fsl_adc16_driver.c"/>
        <file category="source" name="platform/drivers/src/adc16/fsl_adc16_common.c"/>
        <file category="source" name="platform/drivers/src/adc16/fsl_adc16_irq.c" attr="template" select="ADC16 IRQ"/>
        <file category="source" name="platform/drivers/src/adc16/fsl_adc16_lpm_callback.c" attr="template" select="ADC16 LPM"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK Driver" Csub="AOI" Cversion="1.2.0" condition="Kinetis DRV_AOI">
      <description>Crossbar AND/OR/INVERT (AOI) Module</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_AOI
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__aoi__driver.html"/>
        <file category="header" name="platform/drivers/inc/fsl_aoi_driver.h"/>
        <file category="source" name="platform/drivers/src/aoi/fsl_aoi_driver.c"/>
        <file category="source" name="platform/drivers/src/aoi/fsl_aoi_common.c"/>
        <file category="source" name="platform/drivers/src/aoi/fsl_aoi_lpm_callback.c" attr="template" select="AOI LPM"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK Driver" Csub="CADC" Cversion="1.2.0" condition="Kinetis DRV_CADC">
      <description>12-bit Cyclic Analog-to-Digital Converter (CADC)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_CADC
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__cadc__driver.html"/>
        <file category="header" name="platform/drivers/inc/fsl_cadc_driver.h"/>
        <file category="source" name="platform/drivers/src/cyclicAdc/fsl_cadc_driver.c"/>
        <file category="source" name="platform/drivers/src/cyclicAdc/fsl_cadc_common.c"/>
        <file category="source" name="platform/drivers/src/cyclicAdc/fsl_cyclicAdc_lpm_callback.c" attr="template" select="CADC LPM"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK Driver" Csub="CMP" Cversion="1.2.0" condition="Kinetis DRV_CMP">
      <description>Comparator (CMP)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_CMP
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__cmp__driver.html"/>
        <file category="header" name="platform/drivers/inc/fsl_cmp_driver.h"/>
        <file category="source" name="platform/drivers/src/cmp/fsl_cmp_driver.c"/>
        <file category="source" name="platform/drivers/src/cmp/fsl_cmp_common.c"/>
        <file category="source" name="platform/drivers/src/cmp/fsl_cmp_irq.c" attr="template" select="CMP IRQ"/>
        <file category="source" name="platform/drivers/src/cmp/fsl_cmp_lpm_callback.c" attr="template" select="CMP LPM"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK Driver" Csub="COP" Cversion="1.2.0" condition="Kinetis DRV_COP">
      <description>Computer Operating Properly (COP) Watchdog Timer</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_COP
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__cop__driver.html"/>
        <file category="header" name="platform/drivers/inc/fsl_cop_driver.h"/>
        <file category="source" name="platform/drivers/src/cop/fsl_cop_driver.c"/>
        <file category="source" name="platform/drivers/src/cop/fsl_cop_common.c"/>
        <file category="source" name="platform/drivers/src/cop/fsl_cop_lpm_callback.c" attr="template" select="COP LPM"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK Driver" Csub="CRC" Cversion="1.2.0" condition="Kinetis DRV_CRC">
      <description>Cyclic Redundancy Check (CRC)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_CRC
      </RTE_Components_h>
      <files>
    <!--<file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__crc__driver.html"/>-->
        <file category="header" name="platform/drivers/inc/fsl_crc_driver.h"/>
        <file category="source" name="platform/drivers/src/crc/fsl_crc_driver.c"/>
        <file category="source" name="platform/drivers/src/crc/fsl_crc_common.c"/>
        <file category="source" name="platform/drivers/src/crc/fsl_crc_lpm_callback.c" attr="template" select="CRC LPM"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK Driver" Csub="DAC" Cversion="1.2.0" condition="Kinetis DRV_DAC">
      <description>Digital-to-Analog Converter (DAC)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_DAC
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__dac__driver.html"/>
        <file category="header" name="platform/drivers/inc/fsl_dac_driver.h"/>
        <file category="source" name="platform/drivers/src/dac/fsl_dac_driver.c"/>
        <file category="source" name="platform/drivers/src/dac/fsl_dac_common.c"/>
        <file category="source" name="platform/drivers/src/dac/fsl_dac_irq.c" attr="template" select="DAC IRQ"/>
        <file category="source" name="platform/drivers/src/dac/fsl_dac_lpm_callback.c" attr="template" select="DAC LPM"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK Driver" Csub="DMA" Cversion="1.2.0" condition="Kinetis DRV_DMA">
      <description>Direct Memory Access (DMA)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_DMA
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__dma__driver.html"/>
        <file category="header" name="platform/drivers/inc/fsl_dma_driver.h"/>
        <file category="source" name="platform/drivers/src/dma/fsl_dma_driver.c"/>
        <file category="source" name="platform/drivers/src/dma/fsl_dma_common.c"/>
        <file category="source" name="platform/drivers/src/dma/fsl_dma_irq.c"/>
        <file category="source" name="platform/drivers/src/dma/fsl_dma_lpm_callback.c" attr="template" select="DMA LPM"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK Driver" Csub="DSPI" Cvariant="IRQ" Cversion="1.2.0" condition="Kinetis DRV_DSPI_IRQ">
      <description>Serial Peripheral Interface (DSPI): Interrupt driven</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_DSPI_IRQ
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__dspi.html"/>
        <file category="header" name="platform/drivers/inc/fsl_dspi_master_driver.h"/>
        <file category="header" name="platform/drivers/inc/fsl_dspi_slave_driver.h"/>
        <file category="source" name="platform/drivers/src/dspi/fsl_dspi_common.c"/>
        <file category="source" name="platform/drivers/src/dspi/fsl_dspi_master_driver.c"/>
        <file category="source" name="platform/drivers/src/dspi/fsl_dspi_slave_driver.c"/>
        <file category="source" name="platform/drivers/src/dspi/fsl_dspi_shared_function.c"/>
        <file category="source" name="platform/drivers/src/dspi/fsl_dspi_irq.c"/>
        <file category="source" name="platform/drivers/src/dspi/fsl_dspi_lpm_callback.c" attr="template" select="DSPI LPM"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK Driver" Csub="DSPI" Cvariant="DMA" Cversion="1.2.0" condition="Kinetis DRV_DSPI_DMA">
      <description>Serial Peripheral Interface (DSPI): DMA driven</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_DSPI_DMA
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__dspi.html"/>
        <file category="header" name="platform/drivers/inc/fsl_dspi_edma_master_driver.h"/>
        <file category="header" name="platform/drivers/inc/fsl_dspi_edma_slave_driver.h"/>
        <file category="source" name="platform/drivers/src/dspi/fsl_dspi_common.c"/>
        <file category="source" name="platform/drivers/src/dspi/fsl_dspi_edma_master_driver.c"/>
        <file category="source" name="platform/drivers/src/dspi/fsl_dspi_edma_slave_driver.c"/>
        <file category="source" name="platform/drivers/src/dspi/fsl_dspi_edma_shared_function.c"/>
        <file category="source" name="platform/drivers/src/dspi/fsl_dspi_edma_irq.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK Driver" Csub="eDMA" Cversion="1.2.0" condition="Kinetis DRV_EDMA">
      <description>Enhanced Direct Memory Access (eDMA)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_EDMA
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__edma__driver.html"/>
        <file category="header" name="platform/drivers/inc/fsl_edma_driver.h"/>
        <file category="source" name="platform/drivers/src/edma/fsl_edma_driver.c"/>
        <file category="source" name="platform/drivers/src/edma/fsl_edma_common.c"/>
        <file category="source" name="platform/drivers/src/edma/fsl_edma_irq.c"/>
        <file category="source" name="platform/drivers/src/edma/fsl_edma_lpm_callback.c" attr="template" select="eDMA LPM"/>
      </files>
    </component>
