t21/Walnut_X/Packages/.cache/Keil.Kinetis_SDK_DFP.2.2.0.pdsc
    <component Cclass="Device" Cgroup="KSDK Driver" Csub="ENC" Cversion="1.2.0" condition="Kinetis DRV_ENC">
      <description>Quadrature Encoder/Decoder (ENC)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_ENC
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__enc__driver.html"/>
        <file category="header" name="platform/drivers/inc/fsl_enc_driver.h"/>
        <file category="source" name="platform/drivers/src/enc/fsl_enc_driver.c"/>
        <file category="source" name="platform/drivers/src/enc/fsl_enc_common.c"/>
        <file category="source" name="platform/drivers/src/enc/fsl_enc_irq.c"/>
        <file category="source" name="platform/drivers/src/enc/fsl_enc_lpm_callback.c" attr="template" select="ENC LPM"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK Driver" Csub="ENET" Cversion="1.2.0" condition="Kinetis DRV_ENET">
      <description>Ethernet MAC (ENET)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_ENET
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__enet__driver.html"/>
        <file category="header" name="platform/drivers/inc/fsl_enet_driver.h"/>
        <file category="source" name="platform/drivers/src/enet/fsl_enet_driver.c"/>
        <file category="source" name="platform/drivers/src/enet/fsl_enet_common.c"/>
        <file category="source" name="platform/drivers/src/enet/fsl_enet_irq.c"/>
        <file category="source" name="platform/drivers/src/enet/fsl_enet_lpm_callback.c" attr="template" select="ENET LPM"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK Driver" Csub="EWM" Cversion="1.2.0" condition="Kinetis DRV_EWM">
      <description>External Watchdog Timer (EWM)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_EWM
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__ewm__driver.html"/>
        <file category="header" name="platform/drivers/inc/fsl_ewm_driver.h"/>
        <file category="source" name="platform/drivers/src/ewm/fsl_ewm_driver.c"/>
        <file category="source" name="platform/drivers/src/ewm/fsl_ewm_common.c"/>
        <file category="source" name="platform/drivers/src/ewm/fsl_ewm_irq.c" attr="template" select="EWM IRQ"/>
        <file category="source" name="platform/drivers/src/ewm/fsl_ewm_lpm_callback.c" attr="template" select="EWM LPM"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK Driver" Csub="Flash" Cversion="1.2.0" condition="Kinetis">
      <description>Standard Software Driver for C90TFS/FTFx Flash</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_FLASH
      </RTE_Components_h>
      <files>
        <file category="doc"    name="platform/drivers/src/flash/C90TFS/FSL_eNVM_FTFx_UM.pdf"/>
        <file category="header" name="platform/drivers/src/flash/C90TFS/drvsrc/include/SSD_FTFx.h"/>
        <file category="source" name="platform/drivers/src/flash/C90TFS/drvsrc/source/CopyToRam.c"/>
        <file category="source" name="platform/drivers/src/flash/C90TFS/drvsrc/source/DEFlashPartition.c"/>
        <file category="source" name="platform/drivers/src/flash/C90TFS/drvsrc/source/DFlashGetProtection.c"/>
        <file category="source" name="platform/drivers/src/flash/C90TFS/drvsrc/source/DFlashSetProtection.c"/>
        <file category="source" name="platform/drivers/src/flash/C90TFS/drvsrc/source/EEEWrite.c"/>
        <file category="source" name="platform/drivers/src/flash/C90TFS/drvsrc/source/EERAMGetProtection.c"/>
        <file category="source" name="platform/drivers/src/flash/C90TFS/drvsrc/source/EERAMSetProtection.c"/>
        <file category="source" name="platform/drivers/src/flash/C90TFS/drvsrc/source/FlashCheckSum.c"/>
        <file category="source" name="platform/drivers/src/flash/C90TFS/drvsrc/source/FlashCommandSequence.c"/>
        <file category="source" name="platform/drivers/src/flash/C90TFS/drvsrc/source/FlashEraseAllBlock.c"/>
        <file category="source" name="platform/drivers/src/flash/C90TFS/drvsrc/source/FlashEraseBlock.c"/>
        <file category="source" name="platform/drivers/src/flash/C90TFS/drvsrc/source/FlashEraseResume.c"/>
        <file category="source" name="platform/drivers/src/flash/C90TFS/drvsrc/source/FlashEraseSector.c"/>
        <file category="source" name="platform/drivers/src/flash/C90TFS/drvsrc/source/FlashEraseSuspend.c"/>
        <file category="source" name="platform/drivers/src/flash/C90TFS/drvsrc/source/FlashGetSecurityState.c"/>
        <file category="source" name="platform/drivers/src/flash/C90TFS/drvsrc/source/FlashInit.c"/>
        <file category="source" name="platform/drivers/src/flash/C90TFS/drvsrc/source/FlashProgram.c"/>
        <file category="source" name="platform/drivers/src/flash/C90TFS/drvsrc/source/FlashProgramCheck.c"/>
        <file category="source" name="platform/drivers/src/flash/C90TFS/drvsrc/source/FlashProgramOnce.c"/>
        <file category="source" name="platform/drivers/src/flash/C90TFS/drvsrc/source/FlashProgramSection.c"/>
        <file category="source" name="platform/drivers/src/flash/C90TFS/drvsrc/source/FlashReadOnce.c"/>
        <file category="source" name="platform/drivers/src/flash/C90TFS/drvsrc/source/FlashReadResource.c"/>
        <file category="source" name="platform/drivers/src/flash/C90TFS/drvsrc/source/FlashSecurityBypass.c"/>
        <file category="source" name="platform/drivers/src/flash/C90TFS/drvsrc/source/FlashVerifyAllBlock.c"/>
        <file category="source" name="platform/drivers/src/flash/C90TFS/drvsrc/source/FlashVerifyBlock.c"/>
        <file category="source" name="platform/drivers/src/flash/C90TFS/drvsrc/source/FlashVerifySection.c"/>
        <file category="source" name="platform/drivers/src/flash/C90TFS/drvsrc/source/PFlashGetProtection.c"/>
        <file category="source" name="platform/drivers/src/flash/C90TFS/drvsrc/source/PFlashSetProtection.c"/>
        <file category="source" name="platform/drivers/src/flash/C90TFS/drvsrc/source/PFlashSwap.c"/>
        <file category="source" name="platform/drivers/src/flash/C90TFS/drvsrc/source/PFlashSwapCtl.c"/>
        <file category="source" name="platform/drivers/src/flash/C90TFS/drvsrc/source/SetEEEEnable.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK Driver" Csub="FLEXBUS" Cversion="1.2.0" condition="Kinetis DRV_FLEXBUS">
      <description>External Bus Interface (FLEXBUS)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_FLEXBUS
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__flexbus__driver.html"/>
        <file category="header" name="platform/drivers/inc/fsl_flexbus_driver.h"/>
        <file category="source" name="platform/drivers/src/flexbus/fsl_flexbus_driver.c"/>
        <file category="source" name="platform/drivers/src/flexbus/fsl_flexbus_common.c"/>
        <file category="source" name="platform/drivers/src/flexbus/fsl_flexbus_lpm_callback.c" attr="template" select="FLEXBUS LPM"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK Driver" Csub="FlexCAN" Cversion="1.2.0" condition="Kinetis DRV_FlexCAN">
      <description>Controller Area Network (FlexCAN)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_FLEXCAN
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__flexcan__driver.html"/>
        <file category="header" name="platform/drivers/inc/fsl_flexcan_driver.h"/>
        <file category="source" name="platform/drivers/src/flexcan/fsl_flexcan_driver.c"/>
        <file category="source" name="platform/drivers/src/flexcan/fsl_flexcan_common.c"/>
        <file category="source" name="platform/drivers/src/flexcan/fsl_flexcan_irq.c"/>
        <file category="source" name="platform/drivers/src/flexcan/fsl_flexcan_lpm_callback.c" attr="template" select="FlexCAN LPM"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK Driver" Csub="FLEXIO" Cversion="1.2.0" condition="Kinetis DRV_FLEXIO">
      <description>FlexIO (FLEXIO)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_FLEXIO
      </RTE_Components_h>
      <files>
    <!--<file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__flexio__driver.html"/>-->
        <file category="header" name="platform/drivers/inc/fsl_flexio_driver.h"/>
        <file category="source" name="platform/drivers/src/flexio/fsl_flexio_driver.c"/>
        <file category="source" name="platform/drivers/src/flexio/fsl_flexio_common.c"/>
        <file category="source" name="platform/drivers/src/flexio/fsl_flexio_irq.c"/>
        <file category="source" name="platform/drivers/src/flexio/fsl_flexio_lpm_callback.c" attr="template" select="FlexIO LPM"/>
      </files>
    </component>
