t21/Walnut_X/Packages/.cache/Keil.Kinetis_SDK_DFP.2.2.0.pdsc
    <component Cclass="Device" Cgroup="KSDK Driver" Csub="PIT" Cversion="1.2.0" condition="Kinetis DRV_PIT">
      <description>Periodic Interrupt Timer (PIT)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_PIT
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__pit__driver.html"/>
        <file category="header" name="platform/drivers/inc/fsl_pit_driver.h"/>
        <file category="source" name="platform/drivers/src/pit/fsl_pit_driver.c"/>
        <file category="source" name="platform/drivers/src/pit/fsl_pit_common.c"/>
        <file category="source" name="platform/drivers/src/pit/fsl_pit_irq.c" attr="template" select="PIT IRQ"/>
        <file category="source" name="platform/drivers/src/pit/fsl_pit_lpm_callback.c" attr="template" select="PIT LPM"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK Driver" Csub="PWM" Cversion="1.2.0" condition="Kinetis DRV_PWM">
      <description>Pulse Width Modulator (PWM)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_PWM
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__pwm__driver.html"/>
        <file category="header" name="platform/drivers/inc/fsl_pwm_driver.h"/>
        <file category="source" name="platform/drivers/src/pwm/fsl_pwm_driver.c"/>
        <file category="source" name="platform/drivers/src/pwm/fsl_pwm_common.c"/>
        <file category="source" name="platform/drivers/src/pwm/fsl_pwm_irq.c"/>
        <file category="source" name="platform/drivers/src/pwm/fsl_pwm_lpm_callback.c" attr="template" select="PWM LPM"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK Driver" Csub="RNGA" Cversion="1.2.0" condition="Kinetis DRV_RNGA">
      <description>Random Number Generator Accelerator (RNGA)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_RNGA
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__rnga__driver.html"/>
        <file category="header" name="platform/drivers/inc/fsl_rnga_driver.h"/>
        <file category="source" name="platform/drivers/src/rnga/fsl_rnga_driver.c"/>
        <file category="source" name="platform/drivers/src/rnga/fsl_rnga_common.c"/>
        <file category="source" name="platform/drivers/src/rnga/fsl_rnga_irq.c"/>
        <file category="source" name="platform/drivers/src/rnga/fsl_rnga_lpm_callback.c" attr="template" select="RNGA LPM"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK Driver" Csub="RTC" Cversion="1.2.0" condition="Kinetis DRV_RTC">
      <description>Real Time Clock (RTC)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_RTC
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__rtc__driver.html"/>
        <file category="header" name="platform/drivers/inc/fsl_rtc_driver.h"/>
        <file category="source" name="platform/drivers/src/rtc/fsl_rtc_driver.c"/>
        <file category="source" name="platform/drivers/src/rtc/fsl_rtc_common.c"/>
        <file category="source" name="platform/drivers/src/rtc/fsl_rtc_irq.c" attr="template" select="RTC IRQ"/>
        <file category="source" name="platform/drivers/src/rtc/fsl_rtc_lpm_callback.c" attr="template" select="RTC LPM"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK Driver" Csub="SAI" Cversion="1.2.0" condition="Kinetis DRV_SAI">
      <description>Synchronous Audio Interface (SAI)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_SAI
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__sai__driver.html"/>
        <file category="header" name="platform/drivers/inc/fsl_sai_driver.h"/>
        <file category="source" name="platform/drivers/src/sai/fsl_sai_driver.c"/>
        <file category="source" name="platform/drivers/src/sai/fsl_sai_common.c"/>
        <file category="source" name="platform/drivers/src/sai/fsl_sai_irq.c"/>
        <file category="source" name="platform/drivers/src/sai/fsl_sai_lpm_callback.c" attr="template" select="SAI LPM"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK Driver" Csub="SDHC" Cversion="1.2.0" condition="Kinetis DRV_SDHC">
      <description>Secured Digital Host Controller (SDHC)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_SDHC
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__sdhc__pd.html"/>
        <file category="header" name="platform/drivers/inc/fsl_sdhc_driver.h"/>
        <file category="source" name="platform/drivers/src/sdhc/fsl_sdhc_driver.c"/>
        <file category="source" name="platform/drivers/src/sdhc/fsl_sdhc_common.c"/>
        <file category="source" name="platform/drivers/src/sdhc/fsl_sdhc_irq.c"/>
        <file category="source" name="platform/drivers/src/sdhc/fsl_sdhc_lpm_callback.c" attr="template" select="SDHC LPM"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK Driver" Csub="SPI" Cvariant="IRQ" Cversion="1.2.0" condition="Kinetis DRV_SPI_IRQ">
      <description>Serial Peripheral Interface (SPI): Interrupt driven</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_SPI_IRQ
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__spi.html"/>
        <file category="header" name="platform/drivers/inc/fsl_spi_master_driver.h"/>
        <file category="header" name="platform/drivers/inc/fsl_spi_slave_driver.h"/>
        <file category="source" name="platform/drivers/src/spi/fsl_spi_common.c"/>
        <file category="source" name="platform/drivers/src/spi/fsl_spi_master_driver.c"/>
        <file category="source" name="platform/drivers/src/spi/fsl_spi_slave_driver.c"/>
        <file category="source" name="platform/drivers/src/spi/fsl_spi_shared_function.c"/>
        <file category="source" name="platform/drivers/src/spi/fsl_spi_irq.c"/>
        <file category="source" name="platform/drivers/src/spi/fsl_spi_lpm_callback.c" attr="template" select="SPI LPM"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK Driver" Csub="SPI" Cvariant="DMA" Cversion="1.2.0" condition="Kinetis DRV_SPI_DMA">
      <description>Serial Peripheral Interface (SPI): DMA driven</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_SPI_DMA
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__spi.html"/>
        <file category="header" name="platform/drivers/inc/fsl_spi_dma_master_driver.h"/>
        <file category="header" name="platform/drivers/inc/fsl_spi_dma_slave_driver.h"/>
        <file category="source" name="platform/drivers/src/spi/fsl_spi_common.c"/>
        <file category="source" name="platform/drivers/src/spi/fsl_spi_dma_shared_function.c"/>
        <file category="source" name="platform/drivers/src/spi/fsl_spi_dma_master_driver.c"/>
        <file category="source" name="platform/drivers/src/spi/fsl_spi_dma_slave_driver.c"/>
        <file category="source" name="platform/drivers/src/spi/fsl_spi_dma_irq.c"/>
        <file category="source" name="platform/drivers/src/spi/fsl_spi_lpm_callback.c" attr="template" select="SPI LPM"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK Driver" Csub="TPM" Cversion="1.2.0" condition="Kinetis DRV_TPM">
      <description>Timer/PWM Module (TPM)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_TPM
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__tpm__driver.html"/>
        <file category="header" name="platform/drivers/inc/fsl_tpm_driver.h"/>
        <file category="source" name="platform/drivers/src/tpm/fsl_tpm_driver.c"/>
        <file category="source" name="platform/drivers/src/tpm/fsl_tpm_common.c"/>
        <file category="source" name="platform/drivers/src/tpm/fsl_tpm_irq.c"/>
        <file category="source" name="platform/drivers/src/tpm/fsl_tpm_lpm_callback.c" attr="template" select="TPM LPM"/>
      </files>
    </component>
