t21/Walnut_X/Packages/.cache/Keil.Kinetis_SDK_DFP.2.2.0.pdsc
    <component Cclass="CMSIS Driver" Cgroup="SAI" Capiversion="1.0" Cversion="1.2" condition="Kinetis_K64F CMSIS_Driver SAI">
      <description>USART Driver for K64F Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_SAI0              /* Driver SAI0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="addon_cmsis/Driver/MK64F/SAI_MK64F.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="USB Device" Capiversion="2.1" Cversion="1.1" condition="Kinetis_K64F CMSIS_Driver USB">
      <description>USB Device Driver for K64F Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USBD0               /* Driver USBD0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="addon_cmsis/Driver/MK64F/OTG_FS_MK64F.c"/>
        <file category="source" name="addon_cmsis/Driver/MK64F/USBD_FS_MK64F.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="USB Host" Capiversion="2.1" Cversion="1.1" condition="Kinetis_K64F CMSIS_Driver USB">
      <description>USB Host Driver for K64F Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USBH0               /* Driver USBH0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="addon_cmsis/Driver/MK64F/OTG_FS_MK64F.c"/>
        <file category="source" name="addon_cmsis/Driver/MK64F/USBH_FS_MK64F.c"/>
      </files>
    </component>

    <bundle Cbundle="FRDM-K64F" Cclass="Board Support" Cversion="1.2">
      <description>Freescale FRDM-K64F Development Board</description>
      <doc>addon_mdk/Documents/FRDMK64FUG.pdf</doc>
      <component Cgroup="LED" condition="Kinetis FRDM-K64F BSP">
        <description>LED Interface for FRDM-K64F</description>
        <files>
          <file category="source" name="addon_mdk/Boards/Freescale/FRDM-K64F/Common/LED_FRDM_K64F.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" condition="Kinetis FRDM-K64F BSP">
        <description>Buttons Interface for FRDM-K64F</description>
        <files>
          <file category="source" name="addon_mdk/Boards/Freescale/FRDM-K64F/Common/Buttons_FRDM_K64F.c"/>
        </files>
      </component>
      <component Cgroup="Accelerometer" condition="Kinetis FRDM-K64F BSP I2C">
        <description>Accelerometer Interface for FXOS8700</description>
        <RTE_Components_h>
          #define RTE_BOARD_SUPPORT_ACCELEROMETER
        </RTE_Components_h>
        <files>
          <file category="source" name="addon_mdk/Boards/Freescale/FRDM-K64F/Common/FXOS8700.c"/>
        </files>
      </component>
      <component Cgroup="Magnetometer" condition="Kinetis FRDM-K64F BSP I2C">
        <description>Magnetometer Interface for FXOS8700</description>
        <RTE_Components_h>
          #define RTE_BOARD_SUPPORT_MAGNETOMETER
        </RTE_Components_h>
        <files>
          <file category="source" name="addon_mdk/Boards/Freescale/FRDM-K64F/Common/FXOS8700.c"/>
        </files>
      </component>
    </bundle>
  </components>

</package>
